
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["atc-router"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"377242382b17a98afdfd21dafda03aab03dfb9ffce8bca96c899e07e84ece1cb\"" -> "W/\"27f592416f37065104235c283bdf835d17551ea1183c2602b9541f0e0a7ddaec\""
        id                          = "atc-router"
        name                        = "atc-router"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-development"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"768ef02f10237fda055f3408a1a96c41f90b4dbc47fbd53e4e440b8241689018\"" -> "W/\"cd7e9f3454b830e49050d39b345a76527353ea98cfbed15412536b8bf6dc9c33\""
        id                          = "kong-development"
        name                        = "kong-development"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-package"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"0c81c6f3578217457db8d94bbfb929a768dc23a8782fd0ef503a3b037c6c3d88\"" -> "W/\"47d674244b92784bb2f304222d06085b5557d079af30fe377c65ddc3f8c0147b\""
        id                          = "kong-package"
        name                        = "kong-package"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["multi-arch-fpm"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"372b5b6514b7bee119f52b4c1aab5d43f9a031fcc4005611fd56e3725ac210c0\"" -> "W/\"574dea3508d2dee53c59d9c5c203eb3f06da5d87db6421ec1fc751bc2591eb2f\""
        id                          = "multi-arch-fpm"
        name                        = "multi-arch-fpm"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"1d382969cd686448312df6587edcb9861f9e067230fea13a4c14eb66a2adee28\"" -> "W/\"e0a9126c8ff59a8dd21842a7b0d4424aae221ffa415c9af451cd52d00cb304bd\""
        id          = "1393928"
        name        = "protect-main-branch-kong-build-images-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c7ebcff006f2ee641090008a3eb5fdd42b93bf29c5deee22ea7bda5fdc34de91\"" -> "W/\"38ecbe815a618bf3a93e68fb65567bf100faf36ef9b7e62cb42c7d8d231a02b8\""
        id          = "1393929"
        name        = "protect-main-branch-kong-development-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"94ffc434ffcc68ad8dcaf81b049603bbd13b76e184d5eee105511235d7211d59\"" -> "W/\"66f44c6e8a051bd68a517a77b0b128fa26fff6f49606d1970d3943f315495e2a\""
        id          = "1393927"
        name        = "protect-main-branch-kong-openssl-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"c7e66f2887dae8aa51cfbb1788a07d30342a6a40db14be9df203ebf6cac78ff2\"" -> "W/\"0ebb30e6f8d34c66155f95d85d09666215f9775dfb43ba289c3bd7f423287207\""
        id          = "1393870"
        name        = "protect-main-branch-kong-package-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"99a369cb2ad3c070a014f97c7846dd6e93d670a015035c508d7f69773bf9a811\"" -> "W/\"5766706c23fb43bac3f0facd139dc36cfb318ab5f3300d22f27d0f914d6b2002\""
        id          = "1393918"
        name        = "protect-main-branch-kong-runtime-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["multi-arch-fpm"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"906e546045f4f926eaee5a720df79ac97a32f7c3ed4d34b2571d46bce2be8e39\"" -> "W/\"e00a0baedb7781ae9302b14da9ce2a9f843f622b8e6d5f47b84e388573bbd50b\""
        id          = "1391897"
        name        = "protect-main-branch-multi-arch-fpm-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"d22018616b8a17d2a0839682dd1356867f14c3579cad7a5798c5c013de0f064a\"" -> "W/\"fc1023dcff897dc974dd3e505547a9d82dca34c0805639a098e3d96f5a9544b7\""
        id          = "1393934"
        name        = "protect-main-branch-template-1-github-release-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"6258b16fa76b907cb35571857e3e25695a5c5101204a7103d9afdbd15d28a229\"" -> "W/\"e9af1133147403c8778ea266044bb640239773aaff3e48243e921c7fc8bb2c08\""
        id          = "1393937"
        name        = "protect-main-branch-template-1-terraform-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"9e54516afa74f3e6ad7a3793031fa5d49e03c5f6ac6a485d54a7154c8b0fd4c3\"" -> "W/\"dc56467deb804e82e40948a24a0f3c663bdff864ff1160dbe752fecb17e4c3e4\""
        id          = "1393936"
        name        = "protect-main-branch-template-template-pre-commit"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"497bbd4a052e1b8e31855e8ec4ab248ffe19bb2ebd648d8e6323bf7e80cc3f53\"" -> "W/\"a853fd2b14712efe620de2f8f49bc98f30fa0155f96c002eff7230379aab2d76\""
        id          = "1393924"
        name        = "protect-main-branch-kong-build-images-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-development"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"d21151c28069961bfb7654183b5bec12a0bcd7b4a5e3873c12bd6d606442d113\"" -> "W/\"de4175c9ec16dc3e56db91f4173dca0184d8b7c3608e8535ef0f5571fb0ef715\""
        id          = "1393926"
        name        = "protect-main-branch-kong-development-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"cc81ec90ce36ddea35f349ee1ae89626c1e8a8688073358b14d81a2a86ae0a6f\"" -> "W/\"664f13341452047483533eabbdeb3c68934e9b64edbcd238f56df4e42a3085a8\""
        id          = "1393925"
        name        = "protect-main-branch-kong-openssl-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-package"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"790b2bdecc47a95c232b18ad4019c2d33f226e5742bd0aabadc3980988c240f5\"" -> "W/\"274311c7910845bca83a7801af7535b898097b37e14cdced409cce9f613321f9\""
        id          = "1393871"
        name        = "protect-main-branch-kong-package-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_kong" {
      ~ etag        = "W/\"36c1bd501ce99330c83e54f9fb87204221c02ab8f658d4434c45ffbd4ef531ee\"" -> "W/\"da11eba8e4fb562f01b7b4a05c3a4a99dae46a77b94b7363ba8fd0f9b8532479\""
        id          = "1393916"
        name        = "protect-main-branch-kong-runtime-release"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"1c7aa9f2b698282c2dd72638eccca4aac149f65cb254592d083d7a1136a3eb87\"" -> "W/\"fe9e0d2116b7049ef26afa39e109a5c10ba231ae17632033c397ebd27041281e\""
        id          = "1393933"
        name        = "protect-main-branch-template-1-terraform-terraform-plan"
        # (5 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_all["atc-router"] will be updated in-place
  ~ resource "github_repository" "settings_all" {
        id                          = "atc-router"
        name                        = "atc-router"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-openssl"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-openssl"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["kong-runtime"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "kong-runtime"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "gh-org-template"
          + repository           = "template-1-github-release"
        }
    }

  # github_repository.settings_all["template-template"] will be created
  + resource "github_repository" "settings_all" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "template-template"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + advanced_security {
              + status = (known after apply)
            }

          + secret_scanning {
              + status = (known after apply)
            }

          + secret_scanning_push_protection {
              + status = (known after apply)
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["atc-router"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-atc-router-pre-commit"
      + node_id     = (known after apply)
      + repository  = "atc-router"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-terraform-github-pre-commit"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["multi-arch-fpm"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-multi-arch-fpm-release"
      + node_id     = (known after apply)
      + repository  = "multi-arch-fpm"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "Done"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_terraform" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-terraform-github-terraform-plan"
      + node_id     = (known after apply)
      + repository  = "terraform-github"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 952934
          + actor_type  = "Integration"
          + bypass_mode = "always"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "terraform"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->